app/controllers/archivos_controller.rb

SELECT "archivos".* FROM "archivos"
---
  def index
    @archivos = Archivo.all

INSERT INTO "archivos" ("nombre_archivo", "descripcion_corta", "descripcion_larga", "orden", "estado", "usu_crea", "fec_crea", "usu_mod", "fec_mod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @archivo = Archivo.new(archivo_params)

    respond_to do |format|
      if @archivo.save

UPDATE "archivos" SET "estado" = ?, "updated_at" = ? WHERE "archivos"."id" = ?  [["estado", "★"], ["updated_at", "2020-11-01 01:52:52.064866"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @archivo.update(archivo_params)

SELECT "archivos".* FROM "archivos" WHERE "archivos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_archivo
      @archivo = Archivo.find(params[:id])