app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    @clientes = Cliente.all

INSERT INTO "clientes" ("tipo_documento", "numero_documento", "estado", "usu_crea", "fec_crea", "usu_mod", "fec_mod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cliente
      @cliente = Cliente.find(params[:id])