app/controllers/departamentos_controller.rb

SELECT "departamentos".* FROM "departamentos"
---
  def index
    @departamentos = Departamento.all

INSERT INTO "departamentos" ("cod_departamento", "cod_proyecto", "numero", "piso", "area_total", "area_techada", "dormitorios", "baños", "mca_favorito", "descripcion_corta", "descripcion_larga", "estado", "usu_crea", "fec_crea", "usu_mod", "fec_mod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @departamento = Departamento.new(departamento_params)

    respond_to do |format|
      if @departamento.save

UPDATE "departamentos" SET "descripcion_corta" = ?, "updated_at" = ? WHERE "departamentos"."id" = ?  [["descripcion_corta", "descripcion corta de ejemplo para el departamento"], ["updated_at", "2020-10-30 05:15:31.717049"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @departamento.update(departamento_params)

SELECT "departamentos".* FROM "departamentos" WHERE "departamentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_departamento
      @departamento = Departamento.find(params[:id])