app/controllers/personas_controller.rb

  def index
    @personas = Persona.all
---
SELECT "personas".* FROM "personas"

  def create
    @persona = Persona.new(persona_params)

    respond_to do |format|
      if @persona.save
---
INSERT INTO "personas" ("tipo_documento", "numero_documento", "nombres", "apellidos", "correo", "telefono", "mca_juridico", "sexo", "fecha_aniversario", "date", "estado", "usu_crea", "fec_crea", "usu_mod", "fec_mod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_persona
      @persona = Persona.find(params[:id])
---
SELECT "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]