app/controllers/proyectos_controller.rb

SELECT "proyectos".* FROM "proyectos"
---
  def index
    @proyectos = Proyecto.all

SELECT "departamentos".* FROM "departamentos"
---
  def show
    @departamentos = Departamento.all

INSERT INTO "proyectos" ("cod_proyecto", "nombre", "ubicacion", "descripcion_corta", "descripcion_larga", "precio_m2", "mca_favorito", "estado", "usu_crea", "fec_crea", "usu_mod", "fec_mod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @proyecto = Proyecto.new(proyecto_params)

    respond_to do |format|
      if @proyecto.save

UPDATE "proyectos" SET "nombre" = ?, "ubicacion" = ?, "updated_at" = ? WHERE "proyectos"."id" = ?  [["nombre", "Paso 28 de Julio"], ["ubicacion", "Av. 28 de Julio 873 - Miraflores"], ["updated_at", "2020-10-28 06:32:38.233846"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @proyecto.update(proyecto_params)

DELETE FROM "proyectos" WHERE "proyectos"."id" = ?  [["id", 1]]
---
  def destroy
    @proyecto.destroy

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_proyecto
      @proyecto = Proyecto.find(params[:id])