app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("tipo_documento", "numero_documento", "codigo_usuario", "contraseña", "correo_corporativo", "perfil", "estado", "usu_crea", "fec_crea", "usu_mod", "fec_mod", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "correo_corporativo" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["correo_corporativo", "jbolivar@grupo1.com"], ["updated_at", "2020-11-02 05:49:44.237671"], ["id", 2]]

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]